+++++Run S+D stationary rates ++++++++++ 
Darcy  fe: FESystem<2>[FE_Q<2>(2)^2-FE_Q<2>(1)]
Stokes fe: FESystem<2>[FE_Q<2>(2)^2-FE_Q<2>(1)]
Grad div         : 0
CG LSQ eps       : 1e-06
Darcy BC weak    : True
Flux refinements : 2
# workers        : 4
+++++Run S+D stationary rates ++++++++++ 
+++++Run S+D stationary rates ++++++++++ 
+++++Run S+D stationary rates ++++++++++ 
I am worker 2 and I expect to send/receive 17 units to worker 0 with disp 0
I am worker 2 and I expect to send/receive 0 units to worker 1 with disp 17
I am worker 3 and I expect to send/receive 17 units to worker 0 with disp 0
I am worker 3 and I expect to send/receive 0 units to worker 1 with disp 17
*******Embedded triangulation information********
                   h           : 0.0625
I am worker 0 and I expect to send/receive 17 units to worker 2 with disp 0
I am worker 0 and I expect to send/receive 0 units to worker 3 with disp 17
---size(0): 34
---size(1): 34
p(0): 0.5 1
p(1): 0.5625 1
p(2): 0.53125 1
p(3): 0.625 1
p(4): 0.59375 1
p(5): 0.6875 1
p(6): 0.65625 1
p(7): 0.75 1
p(8): 0.71875 1
p(9): 0.8125 1
p(10): 0.78125 1
p(11): 0.875 1
p(12): 0.84375 1
p(13): 0.9375 1
p(14): 0.90625 1
p(15): 1 1
p(16): 0.96875 1
 *** P(0): 0 1
 *** P(1): 0.03125 1
 *** P(2): 0.0625 1
 *** P(3): 0.09375 1
 *** P(4): 0.125 1
 *** P(5): 0.15625 1
 *** P(6): 0.1875 1
 *** P(7): 0.21875 1
 *** P(8): 0.25 1
 *** P(9): 0.28125 1
 *** P(10): 0.3125 1
 *** P(11): 0.34375 1
 *** P(12): 0.375 1
 *** P(13): 0.40625 1
 *** P(14): 0.4375 1
 *** P(15): 0.46875 1
 *** P(16): 0.5 1
 *** P(17): 0.5 1
 *** P(18): 0.53125 1
 *** P(19): 0.5625 1
 *** P(20): 0.59375 1
 *** P(21): 0.625 1
 *** P(22): 0.65625 1
 *** P(23): 0.6875 1
 *** P(24): 0.71875 1
 *** P(25): 0.75 1
 *** P(26): 0.78125 1
 *** P(27): 0.8125 1
 *** P(28): 0.84375 1
 *** P(29): 0.875 1
 *** P(30): 0.90625 1
 *** P(31): 0.9375 1
 *** P(32): 0.96875 1
 *** P(33): 1 1
...I got point 0 1 from worker 2
...I got point 0.03125 1 from worker 2
...I got point 0.0625 1 from worker 2
...I got point 0.09375 1 from worker 2
...I got point 0.125 1 from worker 2
...I got point 0.15625 1 from worker 2
...I got point 0.1875 1 from worker 2
...I got point 0.21875 1 from worker 2
...I got point 0.25 1 from worker 2
...I got point 0.28125 1 from worker 2
...I got point 0.3125 1 from worker 2
...I got point 0.34375 1 from worker 2
...I got point 0.375 1 from worker 2
...I got point 0.40625 1 from worker 2
...I got point 0.4375 1 from worker 2
...I got point 0.46875 1 from worker 2
...I got point 0.5 1 from worker 2
AAA I accepted point 0.5 1 from worker 2
...I got point 0.5 1 from worker 2
...I got point 0.53125 1 from worker 2
AAA I accepted point 0.53125 1 from worker 2
...I got point 0.5625 1 from worker 2
AAA I accepted point 0.5625 1 from worker 2
...I got point 0.59375 1 from worker 2
AAA I accepted point 0.59375 1 from worker 2
...I got point 0.625 1 from worker 2
AAA I accepted point 0.625 1 from worker 2
...I got point 0.65625 1 from worker 2
AAA I accepted point 0.65625 1 from worker 2
...I got point 0.6875 1 from worker 2
AAA I accepted point 0.6875 1 from worker 2
...I got point 0.71875 1 from worker 2
AAA I accepted point 0.71875 1 from worker 2
...I got point 0.75 1 from worker 2
AAA I accepted point 0.75 1 from worker 2
...I got point 0.78125 1 from worker 2
AAA I accepted point 0.78125 1 from worker 2
...I got point 0.8125 1 from worker 2
AAA I accepted point 0.8125 1 from worker 2
...I got point 0.84375 1 from worker 2
AAA I accepted point 0.84375 1 from worker 2
...I got point 0.875 1 from worker 2
AAA I accepted point 0.875 1 from worker 2
...I got point 0.90625 1 from worker 2
AAA I accepted point 0.90625 1 from worker 2
...I got point 0.9375 1 from worker 2
AAA I accepted point 0.9375 1 from worker 2
...I got point 0.96875 1 from worker 2
AAA I accepted point 0.96875 1 from worker 2
...I got point 1 1 from worker 2
AAA I accepted point 1 1 from worker 2
...I got point 0 2.61361e-321 from worker 3
...I got point 1.82275e-316 1.82271e-316 from worker 3
...I got point 1.82265e-316 2.36054e-310 from worker 3
...I got point 2.37152e-322 2.13436e-321 from worker 3
...I got point 0.5 1 from worker 3
...I got point 0 0.53125 from worker 3
...I got point 1 2.36051e-310 from worker 3
...I got point 0.5625 1 from worker 3
...I got point 6.36599e-314 0.59375 from worker 3
...I got point 1 1.97626e-323 from worker 3
...I got point 0.625 1 from worker 3
...I got point 0.5 0.65625 from worker 3
...I got point 1 2.96439e-323 from worker 3
...I got point 0.6875 1 from worker 3
...I got point 2.47033e-323 0.71875 from worker 3
...I got point 1 3.95253e-323 from worker 3
...I got point 0.75 1 from worker 3
...I got point 3.45846e-323 0.78125 from worker 3
...I got point 1 4.94066e-323 from worker 3
...I got point 0.8125 1 from worker 3
...I got point 4.44659e-323 0.84375 from worker 3
...I got point 1 5.92879e-323 from worker 3
...I got point 0.875 1 from worker 3
...I got point 5.43472e-323 0.90625 from worker 3
...I got point 1 6.91692e-323 from worker 3
...I got point 0.9375 1 from worker 3
...I got point 6.42285e-323 0.96875 from worker 3
...I got point 1 7.90505e-323 from worker 3
...I got point 1.78874e-316 1.82246e-316 from worker 3
...I got point 0 0 from worker 3
...I got point 0 2.42092e-322 from worker 3
...I got point 1.80805e-316 2.36054e-310 from worker 3
...I got point 0 0 from worker 3
...I got point 2.60867e-321 3.16202e-322 from worker 3
I am worker 1 and I expect to send/receive 17 units to worker 2 with disp 0
I am worker 1 and I expect to send/receive 0 units to worker 3 with disp 17
*******Stokes information********
Number of active cells: 256
   Number of degrees of freedom: 2467
                   h           : 0.0883883

*******Darcy information********
Number of active cells: 256
   Number of degrees of freedom: 2467
                   h           : 0.0883883

*******Porosity information********
Number of active cells: 256
   Number of degrees of freedom: 289


*******Grand total********
5223 dofs in the system.


+---------------------------------------------+------------+------------+
| Total wallclock time elapsed since start    |    0.0494s |            |
|                                             |            |            |
| Section                         | no. calls |  wall time | % of total |
+---------------------------------+-----------+------------+------------+
| Darcy grid                      |         1 |  0.000862s |       1.7% |
| Darcy setup dofs                |         1 |    0.0109s |        22% |
| Initialize parallel maps        |         1 |   0.00134s |       2.7% |
| Stokes grid                     |         1 |  0.000109s |      0.22% |
| Stokes setup dofs               |         1 |    0.0198s |        40% |
+---------------------------------+-----------+------------+------------+

